frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/tc.h
#define TC_IER_COVFS_Pos            0            /**< \brief (TC_IER) Counter Overflow */
#define TC_IER_COVFS                (_U(0x1) << TC_IER_COVFS_Pos)
#define   TC_IER_COVFS_0_Val              _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_COVFS_1_Val              _U(0x1)   /**< \brief (TC_IER) Enables the Counter Overflow Interrupt. */
#define TC_IER_COVFS_0              (TC_IER_COVFS_0_Val            << TC_IER_COVFS_Pos)
#define TC_IER_COVFS_1              (TC_IER_COVFS_1_Val            << TC_IER_COVFS_Pos)
#define TC_IER_LOVRS_Pos            1            /**< \brief (TC_IER) Load Overrun */
#define TC_IER_LOVRS                (_U(0x1) << TC_IER_LOVRS_Pos)
#define   TC_IER_LOVRS_0_Val              _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_LOVRS_1_Val              _U(0x1)   /**< \brief (TC_IER) Enables the Load Overrun Interrupt. */
#define TC_IER_LOVRS_0              (TC_IER_LOVRS_0_Val            << TC_IER_LOVRS_Pos)
#define TC_IER_LOVRS_1              (TC_IER_LOVRS_1_Val            << TC_IER_LOVRS_Pos)
#define TC_IER_CPAS_Pos             2            /**< \brief (TC_IER) RA Compare */
#define TC_IER_CPAS                 (_U(0x1) << TC_IER_CPAS_Pos)
#define   TC_IER_CPAS_0_Val               _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_CPAS_1_Val               _U(0x1)   /**< \brief (TC_IER) Enables the RA Compare Interrupt. */
#define TC_IER_CPAS_0               (TC_IER_CPAS_0_Val             << TC_IER_CPAS_Pos)
#define TC_IER_CPAS_1               (TC_IER_CPAS_1_Val             << TC_IER_CPAS_Pos)
#define TC_IER_CPBS_Pos             3            /**< \brief (TC_IER) RB Compare */
#define TC_IER_CPBS                 (_U(0x1) << TC_IER_CPBS_Pos)
#define   TC_IER_CPBS_0_Val               _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_CPBS_1_Val               _U(0x1)   /**< \brief (TC_IER) Enables the RB Compare Interrupt. */
#define TC_IER_CPBS_0               (TC_IER_CPBS_0_Val             << TC_IER_CPBS_Pos)
#define TC_IER_CPBS_1               (TC_IER_CPBS_1_Val             << TC_IER_CPBS_Pos)
#define TC_IER_CPCS_Pos             4            /**< \brief (TC_IER) RC Compare */
#define TC_IER_CPCS                 (_U(0x1) << TC_IER_CPCS_Pos)
#define   TC_IER_CPCS_0_Val               _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_CPCS_1_Val               _U(0x1)   /**< \brief (TC_IER) Enables the RC Compare Interrupt. */
#define TC_IER_CPCS_0               (TC_IER_CPCS_0_Val             << TC_IER_CPCS_Pos)
#define TC_IER_CPCS_1               (TC_IER_CPCS_1_Val             << TC_IER_CPCS_Pos)
#define TC_IER_LDRAS_Pos            5            /**< \brief (TC_IER) RA Loading */
#define TC_IER_LDRAS                (_U(0x1) << TC_IER_LDRAS_Pos)
#define   TC_IER_LDRAS_0_Val              _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_LDRAS_1_Val              _U(0x1)   /**< \brief (TC_IER) Enables the RA Load Interrupt. */
#define TC_IER_LDRAS_0              (TC_IER_LDRAS_0_Val            << TC_IER_LDRAS_Pos)
#define TC_IER_LDRAS_1              (TC_IER_LDRAS_1_Val            << TC_IER_LDRAS_Pos)
#define TC_IER_LDRBS_Pos            6            /**< \brief (TC_IER) RB Loading */
#define TC_IER_LDRBS                (_U(0x1) << TC_IER_LDRBS_Pos)
#define   TC_IER_LDRBS_0_Val              _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_LDRBS_1_Val              _U(0x1)   /**< \brief (TC_IER) Enables the RB Load Interrupt. */
#define TC_IER_LDRBS_0              (TC_IER_LDRBS_0_Val            << TC_IER_LDRBS_Pos)
#define TC_IER_LDRBS_1              (TC_IER_LDRBS_1_Val            << TC_IER_LDRBS_Pos)
#define TC_IER_ETRGS_Pos            7            /**< \brief (TC_IER) External Trigger */
#define TC_IER_ETRGS                (_U(0x1) << TC_IER_ETRGS_Pos)
#define   TC_IER_ETRGS_0_Val              _U(0x0)   /**< \brief (TC_IER) No effect. */
#define   TC_IER_ETRGS_1_Val              _U(0x1)   /**< \brief (TC_IER) Enables the External Trigger Interrupt. */
#define TC_IER_ETRGS_0              (TC_IER_ETRGS_0_Val            << TC_IER_ETRGS_Pos)
#define TC_IER_ETRGS_1              (TC_IER_ETRGS_1_Val            << TC_IER_ETRGS_Pos)
#define TC_IER_MASK                 _U(0x000000FF) /**< \brief (TC_IER) MASK Register */

/* -------- TC_IDR : (TC Offset: 0x28) ( /W 32) channel Interrupt Disable Register Channel -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t COVFS:1;          /*!< bit:      0  Counter Overflow                   */
    uint32_t LOVRS:1;          /*!< bit:      1  Load Overrun                       */
    uint32_t CPAS:1;           /*!< bit:      2  RA Compare                         */
    uint32_t CPBS:1;           /*!< bit:      3  RB Compare                         */
    uint32_t CPCS:1;           /*!< bit:      4  RC Compare                         */
    uint32_t LDRAS:1;          /*!< bit:      5  RA Loading                         */
    uint32_t LDRBS:1;          /*!< bit:      6  RB Loading                         */
    uint32_t ETRGS:1;          /*!< bit:      7  External Trigger                   */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_IDR_OFFSET               0x28         /**< \brief (TC_IDR offset) Interrupt Disable Register Channel */
#define TC_IDR_RESETVALUE           _U(0x00000000); /**< \brief (TC_IDR reset_value) Interrupt Disable Register Channel */

#define TC_IDR_COVFS_Pos            0            /**< \brief (TC_IDR) Counter Overflow */
#define TC_IDR_COVFS                (_U(0x1) << TC_IDR_COVFS_Pos)
#define   TC_IDR_COVFS_0_Val              _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_COVFS_1_Val              _U(0x1)   /**< \brief (TC_IDR) Disables the Counter Overflow Interrupt. */
#define TC_IDR_COVFS_0              (TC_IDR_COVFS_0_Val            << TC_IDR_COVFS_Pos)
#define TC_IDR_COVFS_1              (TC_IDR_COVFS_1_Val            << TC_IDR_COVFS_Pos)
#define TC_IDR_LOVRS_Pos            1            /**< \brief (TC_IDR) Load Overrun */
#define TC_IDR_LOVRS                (_U(0x1) << TC_IDR_LOVRS_Pos)
#define   TC_IDR_LOVRS_0_Val              _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_LOVRS_1_Val              _U(0x1)   /**< \brief (TC_IDR) Disables the Load Overrun Interrupt (if WAVE:0). */
#define TC_IDR_LOVRS_0              (TC_IDR_LOVRS_0_Val            << TC_IDR_LOVRS_Pos)
#define TC_IDR_LOVRS_1              (TC_IDR_LOVRS_1_Val            << TC_IDR_LOVRS_Pos)
#define TC_IDR_CPAS_Pos             2            /**< \brief (TC_IDR) RA Compare */
#define TC_IDR_CPAS                 (_U(0x1) << TC_IDR_CPAS_Pos)
#define   TC_IDR_CPAS_0_Val               _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_CPAS_1_Val               _U(0x1)   /**< \brief (TC_IDR) Disables the RA Compare Interrupt (if WAVE:1). */
#define TC_IDR_CPAS_0               (TC_IDR_CPAS_0_Val             << TC_IDR_CPAS_Pos)
#define TC_IDR_CPAS_1               (TC_IDR_CPAS_1_Val             << TC_IDR_CPAS_Pos)
#define TC_IDR_CPBS_Pos             3            /**< \brief (TC_IDR) RB Compare */
#define TC_IDR_CPBS                 (_U(0x1) << TC_IDR_CPBS_Pos)
#define   TC_IDR_CPBS_0_Val               _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_CPBS_1_Val               _U(0x1)   /**< \brief (TC_IDR) Disables the RB Compare Interrupt (if WAVE:1). */
#define TC_IDR_CPBS_0               (TC_IDR_CPBS_0_Val             << TC_IDR_CPBS_Pos)
#define TC_IDR_CPBS_1               (TC_IDR_CPBS_1_Val             << TC_IDR_CPBS_Pos)
#define TC_IDR_CPCS_Pos             4            /**< \brief (TC_IDR) RC Compare */
#define TC_IDR_CPCS                 (_U(0x1) << TC_IDR_CPCS_Pos)
#define   TC_IDR_CPCS_0_Val               _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_CPCS_1_Val               _U(0x1)   /**< \brief (TC_IDR) Disables the RC Compare Interrupt. */
#define TC_IDR_CPCS_0               (TC_IDR_CPCS_0_Val             << TC_IDR_CPCS_Pos)
#define TC_IDR_CPCS_1               (TC_IDR_CPCS_1_Val             << TC_IDR_CPCS_Pos)
#define TC_IDR_LDRAS_Pos            5            /**< \brief (TC_IDR) RA Loading */
#define TC_IDR_LDRAS                (_U(0x1) << TC_IDR_LDRAS_Pos)
#define   TC_IDR_LDRAS_0_Val              _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_LDRAS_1_Val              _U(0x1)   /**< \brief (TC_IDR) Disables the RA Load Interrupt (if WAVE:0). */
#define TC_IDR_LDRAS_0              (TC_IDR_LDRAS_0_Val            << TC_IDR_LDRAS_Pos)
#define TC_IDR_LDRAS_1              (TC_IDR_LDRAS_1_Val            << TC_IDR_LDRAS_Pos)
#define TC_IDR_LDRBS_Pos            6            /**< \brief (TC_IDR) RB Loading */
#define TC_IDR_LDRBS                (_U(0x1) << TC_IDR_LDRBS_Pos)
#define   TC_IDR_LDRBS_0_Val              _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_LDRBS_1_Val              _U(0x1)   /**< \brief (TC_IDR) Disables the RB Load Interrupt (if WAVE:0). */
#define TC_IDR_LDRBS_0              (TC_IDR_LDRBS_0_Val            << TC_IDR_LDRBS_Pos)
#define TC_IDR_LDRBS_1              (TC_IDR_LDRBS_1_Val            << TC_IDR_LDRBS_Pos)
#define TC_IDR_ETRGS_Pos            7            /**< \brief (TC_IDR) External Trigger */
#define TC_IDR_ETRGS                (_U(0x1) << TC_IDR_ETRGS_Pos)
#define   TC_IDR_ETRGS_0_Val              _U(0x0)   /**< \brief (TC_IDR) No effect. */
#define   TC_IDR_ETRGS_1_Val              _U(0x1)   /**< \brief (TC_IDR) Disables the External Trigger Interrupt. */
#define TC_IDR_ETRGS_0              (TC_IDR_ETRGS_0_Val            << TC_IDR_ETRGS_Pos)
#define TC_IDR_ETRGS_1              (TC_IDR_ETRGS_1_Val            << TC_IDR_ETRGS_Pos)
#define TC_IDR_MASK                 _U(0x000000FF) /**< \brief (TC_IDR) MASK Register */

