frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/tc.h
/* -------- TC_FEATURES : (TC Offset: 0xF8) (R/  32) Features Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CTRSIZE:8;        /*!< bit:  0.. 7  Counter Size                       */
    uint32_t UPDNIMPL:1;       /*!< bit:      8  Up Down is Implemented             */
    uint32_t BRPBHSB:1;        /*!< bit:      9  Bridge Type is PB to HSB           */
    uint32_t :22;              /*!< bit: 10..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_FEATURES_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_FEATURES_OFFSET          0xF8         /**< \brief (TC_FEATURES offset) Features Register */

#define TC_FEATURES_CTRSIZE_Pos     0            /**< \brief (TC_FEATURES) Counter Size */
#define TC_FEATURES_CTRSIZE_Msk     (_U(0xFF) << TC_FEATURES_CTRSIZE_Pos)
#define TC_FEATURES_CTRSIZE(value)  (TC_FEATURES_CTRSIZE_Msk & ((value) << TC_FEATURES_CTRSIZE_Pos))
#define TC_FEATURES_UPDNIMPL_Pos    8            /**< \brief (TC_FEATURES) Up Down is Implemented */
#define TC_FEATURES_UPDNIMPL        (_U(0x1) << TC_FEATURES_UPDNIMPL_Pos)
#define TC_FEATURES_BRPBHSB_Pos     9            /**< \brief (TC_FEATURES) Bridge Type is PB to HSB */
#define TC_FEATURES_BRPBHSB         (_U(0x1) << TC_FEATURES_BRPBHSB_Pos)
#define TC_FEATURES_MASK            _U(0x000003FF) /**< \brief (TC_FEATURES) MASK Register */

/* -------- TC_VERSION : (TC Offset: 0xFC) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell. */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Reserved.  Value subject to change.  No functionality associated. */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TC_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_VERSION_OFFSET           0xFC         /**< \brief (TC_VERSION offset) Version Register */
#define TC_VERSION_RESETVALUE       _U(0x00000402); /**< \brief (TC_VERSION reset_value) Version Register */

#define TC_VERSION_VERSION_Pos      0            /**< \brief (TC_VERSION) Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell. */
#define TC_VERSION_VERSION_Msk      (_U(0xFFF) << TC_VERSION_VERSION_Pos)
#define TC_VERSION_VERSION(value)   (TC_VERSION_VERSION_Msk & ((value) << TC_VERSION_VERSION_Pos))
#define TC_VERSION_VARIANT_Pos      16           /**< \brief (TC_VERSION) Reserved.  Value subject to change.  No functionality associated. */
#define TC_VERSION_VARIANT_Msk      (_U(0xF) << TC_VERSION_VARIANT_Pos)
#define TC_VERSION_VARIANT(value)   (TC_VERSION_VARIANT_Msk & ((value) << TC_VERSION_VARIANT_Pos))
#define TC_VERSION_MASK             _U(0x000F0FFF) /**< \brief (TC_VERSION) MASK Register */

/** \brief TcChannel hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  TC_CCR_Type               CCR;         /**< \brief Offset: 0x00 ( /W 32) Channel Control Register Channel */
  __IO TC_CMR_Type               CMR;         /**< \brief Offset: 0x04 (R/W 32) Channel Mode Register Channel */
  __IO TC_SMMR_Type              SMMR;        /**< \brief Offset: 0x08 (R/W 32) Stepper Motor Mode Register */
       RoReg8                    Reserved1[0x4];
  __I  TC_CV_Type                CV;          /**< \brief Offset: 0x10 (R/  32) Counter Value Channel */
  __IO TC_RA_Type                RA;          /**< \brief Offset: 0x14 (R/W 32) Register A Channel */
  __IO TC_RB_Type                RB;          /**< \brief Offset: 0x18 (R/W 32) Register B Channel */
  __IO TC_RC_Type                RC;          /**< \brief Offset: 0x1C (R/W 32) Register C Channel */
  __I  TC_SR_Type                SR;          /**< \brief Offset: 0x20 (R/  32) Status Register Channel */
  __O  TC_IER_Type               IER;         /**< \brief Offset: 0x24 ( /W 32) Interrupt Enable Register Channel */
  __O  TC_IDR_Type               IDR;         /**< \brief Offset: 0x28 ( /W 32) Interrupt Disable Register Channel */
  __I  TC_IMR_Type               IMR;         /**< \brief Offset: 0x2C (R/  32) Interrupt Mask Register Channel */
       RoReg8                    Reserved2[0x10];
 } bf;
 struct {
  WoReg   TC_CCR;             /**< \brief (TC Offset: 0x00) Channel Control Register Channel */
  RwReg   TC_CMR;             /**< \brief (TC Offset: 0x04) Channel Mode Register Channel */
  RwReg   TC_SMMR;            /**< \brief (TC Offset: 0x08) Stepper Motor Mode Register */
  RoReg8  Reserved3[0x4];
  RoReg   TC_CV;              /**< \brief (TC Offset: 0x10) Counter Value Channel */
  RwReg   TC_RA;              /**< \brief (TC Offset: 0x14) Register A Channel */
  RwReg   TC_RB;              /**< \brief (TC Offset: 0x18) Register B Channel */
  RwReg   TC_RC;              /**< \brief (TC Offset: 0x1C) Register C Channel */
  RoReg   TC_SR;              /**< \brief (TC Offset: 0x20) Status Register Channel */
  WoReg   TC_IER;             /**< \brief (TC Offset: 0x24) Interrupt Enable Register Channel */
  WoReg   TC_IDR;             /**< \brief (TC Offset: 0x28) Interrupt Disable Register Channel */
  RoReg   TC_IMR;             /**< \brief (TC Offset: 0x2C) Interrupt Mask Register Channel */
  RoReg8  Reserved4[0x10];
 } reg;
} TcChannel;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

